In [1]:
import pandas as pd

In [3]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [9]:
index = ["Linha "+ str(i) for i in range(3)]
columns = ["Column "+ str(i) for i in range(3)]
df1 = pd.DataFrame(data, index=index, columns=columns)
df1

         Column 0  Column 1  Column 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [20]:
df1.loc["Linha 0"]

Column 0    1
Column 1    2
Column 2    3
Name: Linha 0, dtype: int64

In [19]:
df1.loc[["Linha 0"]]

         Column 0  Column 1  Column 2
Linha 0         1         2         3

In [10]:
my_dict = {"Column 0":{"Linha 0":1, "Linha 1":4, "Linha 2": 7},
            "Column 1":{"Linha 0":2, "Linha 1":5, "Linha 2": 8},
            "Column 2":{"Linha 0":3,"Linha 1":6, "Linha 2":9}}

my_dict

{'Column 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Column 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Column 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [11]:
df2 = pd.DataFrame(my_dict)
df2

         Column 0  Column 1  Column 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [12]:
data2 = [(1,2,3),
        (4,5,6),
        (7,8,9)]
df3 = pd.DataFrame(data2)
df3

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
my_dict2 = {"Leonardo":{"age":24, "city":"Braganca", "num": 10},
            "Laura":{"age":7, "city":"BH", "num": 8},
            "Cicero":{"age":40,"city":"BH", "num":9}}
my_dict2

{'Leonardo': {'age': 24, 'city': 'Braganca', 'num': 10},
 'Laura': {'age': 7, 'city': 'BH', 'num': 8},
 'Cicero': {'age': 40, 'city': 'BH', 'num': 9}}

In [15]:
df4 = pd.DataFrame(my_dict2)
df4

      Leonardo Laura Cicero
age         24     7     40
city  Braganca    BH     BH
num         10     8      9

In [22]:
df4[["Leonardo"]]

      Leonardo
age         24
city  Braganca
num         10

In [26]:
df4["Leonardo"]["age"]

24